EmbeddedSystemClass/freertosTMS570LC43x/TMS570LC43x/epl_1588/epl_regs.h
//****************************************************************************
// epl_regs.h
// 
// Copyright (c) 2006-2008 National Semiconductor Corporation.
// All Rights Reserved
// 
// This module defines all of the registers and fields available
// in National Ethernet Phy devices.
// 
// The following devices are described here:
//      DP83848, DP83849, DP83640
//****************************************************************************

#ifndef _EPL_REGS_INCLUDE
#define	_EPL_REGS_INCLUDE

#include "epl.h"

// Phy Register Indexes - Common Across Device Types
#define PHY_BMCR            0x0000
#define PHY_BMSR            0x0001
#define PHY_IDR1            0x0002
#define PHY_IDR2            0x0003
#define PHY_ANAR            0x0004
#define PHY_ANLPAR          0x0005
#define PHY_ANER            0x0006
#define PHY_ANNPTR          0x0007
#define PHY_PHYSTS          0x0010
#define PHY_MICR            0x0011
#define PHY_MISR            0x0012
#define PHY_PAGESEL         0x0013
#define PHY_FCSCR           0x0014
#define PHY_RECR            0x0015
#define PHY_PCSR            0x0016
#define PHY_RBR             0x0017
#define PHY_LEDCR           0x0018
#define PHY_PHYCTRL         0x0019
#define PHY_10BTSCR         0x001A
#define PHY_CDCTRL1         0x001B
#define PHY_EDCR            0x001D

// DP83848 Specific Register Indexes
#define PHY_AFECR           0x001E
#define PHY_AFEAR           0x001F

// DP83849 / DP83640 Specific Register Indexes
// Note: Bits [6:5] specify the register page (00-pg0, 01-pg1, 10-pg2, 11-pg3)
#define PHY_PG0_PHYCR2      0x001C
#define PHY_PG1_PMDCNFG     0x0034
#define PHY_PG1_TMR1        0x0035
#define PHY_PG1_TMR2        0x0036
#define PHY_PG1_DSP_CTRL1   0x0037
#define PHY_PG1_DSP_CTRL2   0x0038
#define PHY_PG1_TRL_CTRL    0x0039
#define PHY_PG1_DEQ_CTRL    0x003A
#define PHY_PG1_ANEG_TST    0x003B
#define PHY_PG1_EXTCFG      0x003C
#define PHY_PG1_TST_CTRL    0x003D
#define PHY_PG1_SD_CNFG     0x003E
#define PHY_PG1_TSTDAT      0x003F
#define PHY_PG2_LEN100_DET  0x0054
#define PHY_PG2_FREQ100     0x0055
#define PHY_PG2_TDR_CTRL    0x0056
#define PHY_PG2_TDR_WIN     0x0057
#define PHY_PG2_TDR_PEAK    0x0058
#define PHY_PG2_TDR_THR     0x0059
#define PHY_PG2_VAR_CTRL    0x005A
#define PHY_PG2_VAR_DATA    0x005B
#define PHY_PG2_LQMR        0x005D
#define PHY_PG2_LQDR        0x005E

// DP83640 Specific Register Indexes
// Note: Bits [7:5] specify the register page (000-pg0, 001-pg1, 010-pg2, 011-pg3, etc.)
#define PHY_PG2_LQMR2       0x005F
#define PHY_PG3_CGCR        0x0074
#define PHY_PG3_PTPTR       0x0075
#define PHY_PG3_CDCR1       0x0077
#define PHY_PG3_CDCR2       0x0078
#define PHY_PG3_FCO1CR      0x0079
#define PHY_PG3_FCO2CR      0x007A
#define PHY_PG3_ADCCR1      0x007B
#define PHY_PG3_ADCCR2      0x007C
#define PHY_PG3_BGREGCR     0x007D
#define PHY_PG3_CGMCR       0x007E
#define PHY_PG3_PGMCR       0x007F
#define PHY_PG4_PTP_CTL     0x0094
#define PHY_PG4_PTP_TDR     0x0095
#define PHY_PG4_PTP_STS     0x0096
#define PHY_PG4_PTP_TSTS    0x0097
#define PHY_PG4_PTP_RATEL   0x0098
#define PHY_PG4_PTP_RATEH   0x0099
#define PHY_PG4_PTP_RDCKSUM 0x009A
#define PHY_PG4_PTP_WRCKSUM 0x009B
#define PHY_PG4_PTP_TXTS    0x009C
#define PHY_PG4_PTP_RXTS    0x009D
#define PHY_PG4_PTP_ESTS    0x009E
#define PHY_PG4_PTP_EDATA   0x009F
#define PHY_PG5_PTP_TRIG    0x00B4
#define PHY_PG5_PTP_EVNT    0x00B5
#define PHY_PG5_PTP_TXCFG0  0x00B6
#define PHY_PG5_PTP_TXCFG1  0x00B7
#define PHY_PG5_PSF_CFG0    0x00B8
#define PHY_PG5_PTP_RXCFG0  0x00B9
#define PHY_PG5_PTP_RXCFG1  0x00BA
#define PHY_PG5_PTP_RXCFG2  0x00BB
#define PHY_PG5_PTP_RXCFG3  0x00BC
#define PHY_PG5_PTP_RXCFG4  0x00BD
#define PHY_PG5_PTP_TRDL    0x00BE
#define PHY_PG5_PTP_TRDH    0x00BF
#define PHY_PG6_PTP_COC     0x00D4
#define PHY_PG6_PSF_CFG1    0x00D5
#define PHY_PG6_PSF_CFG2    0x00D6
#define PHY_PG6_PSF_CFG3    0x00D7
#define PHY_PG6_PSF_CFG4    0x00D8
#define PHY_PG6_PTP_SFDCFG  0x00D9
#define PHY_PG6_PTP_INTCTL  0x00DA
#define PHY_PG6_PTP_CLKSRC  0x00DB
#define PHY_PG6_PTP_ETR     0x00DC
#define PHY_PG6_PTP_OFF     0x00DD
#define PHY_PG6_PTP_GPIOMON 0x00DE
#define PHY_PG6_PTP_RXHASH  0x00DF


//****************************************************************************
// Common Register Bit Definitions
//****************************************************************************

// PHY_BMCR Defs
#define BMCR_FORCE_SPEED_1000    0x0040
#define BMCR_COLLISION_TEST      0x0080
#define BMCR_FORCE_FULL_DUP      0x0100
#define BMCR_RESTART_AUTONEG     0x0200
#define BMCR_ISOLATE             0x0400
#define BMCR_POWER_DOWN          0x0800
#define BMCR_AUTO_NEG_ENABLE     0x1000
#define BMCR_FORCE_SPEED_100     0x2000
#define BMCR_FORCE_SPEED_10      0x0000
#define BMCR_FORCE_SPEED_MASK    0x2040
#define BMCR_LOOPBACK            0x4000
#define BMCR_RESET               0x8000

// PHY_BMSR Defs
#define BMSR_EXTENDED_CAPABLE    0x0001
#define BMSR_JABBER_DETECT       0x0002
#define BMSR_LINK_STATUS         0x0004
#define BMSR_AUTO_NEG_ABILITY    0x0008
#define BMSR_REMOTE_FAULT        0x0010
#define BMSR_AUTO_NEG_COMPLETE   0x0020
#define BMSR_PREAMBLE_SUPPRESS   0x0040
#define BMSR_RESERVED            0x0080
#define BMSR_1000T_EXT_STATUS    0x0100
#define BMSR_100T2_HALF_DUP      0x0200
#define BMSR_100T2_FULL_DUP      0x0400
#define BMSR_10T_HALF_DUP        0x0800
#define BMSR_10T_FULL_DUP        0x1000
#define BMSR_100X_HALF_DUP       0x2000
#define BMSR_100X_FULL_DUP       0x4000
#define BMSR_100T4_CAPABLE       0x8000

// PHY_IDR1 Defs
#define IDR1_NATIONAL_OUI_VAL    0x2000    // OUI bits 3-18

// PHY_IDR2 Defs
#define IDR2_OUI_MASK            0xFC00
#define IDR2_MODEL_NUMBER_MASK   0x03F0
#define IDR2_REVISION_MASK       0x000F
#define IDR2_MODEL_SHIFT         4

#define IDR2_NATIONAL_OUI_VAL    0x5C00    // OUI bits 19-24 (15:10), Vendor Model (9:4), Revision (3:0)
#define IDR2_MODEL_DP83848_VAL   0x0090    // AspenPhy
#define IDR2_MODEL_DP48_MINI_VAL 0x00C0    // AspenPhy - Mini
#define IDR2_MODEL_DP83849_VAL   0x00A0    // Dual AspenPhy
#define IDR2_MODEL_DP83640_VAL   0x00E0    // High Precision Phy

#define IDR2_REV_DP83848E_VAL    0x0001    // DP83848 Enhanced version

// PHY_ANAR Defs
#define ANAR_PROTO_SEL_MASK      0x001F
#define ANAR_PROTO_8023          0x0001
#define ANAR_10T_HALF_DUP        0x0020
#define ANAR_10T_FULL_DUP        0x0040
#define ANAR_100T_HALF_DUP       0x0080
#define ANAR_100T_FULL_DUP       0x0100
#define ANAR_100T4_SUPPORT       0x0200
#define ANAR_PAUSE_SUPPORT       0x0400
#define ANAR_ASY_PAUSE_SUPPORT   0x0800
#define ANAR_RESERVED0           0x1000
#define ANAR_REMOTE_FAULT        0x2000
#define ANAR_RESERVED1           0x4000
#define ANAR_NEXT_PAGE_IND       0x8000

