EmbeddedSystemClass/freertosTMS570LC43x/TMS570LC43x/epl_1588/epl_regs.h
// PHY_ANLPAR Defs
#define ANLPAR_PROTO_SEL_MASK    0x001F
#define ANLPAR_10T_HALF_DUP      0x0020
#define ANLPAR_10T_FULL_DUP      0x0040
#define ANLPAR_100T_HALF_DUP     0x0080
#define ANLPAR_100T_FULL_DUP     0x0100
#define ANLPAR_100T4_SUPPORT     0x0200
#define ANLPAR_PAUSE_SUPPORT     0x0400
#define ANLPAR_ASY_PAUSE         0x0800
#define ANLPAR_RESERVED0         0x1000
#define ANLPAR_REMOTE_FAULT      0x2000
#define ANLPAR_ACK               0x4000
#define ANLPAR_NEXT_PAGE_IND     0x8000

// PHY_ANER Defs
#define ANER_AUTO_NEG_CAPABLE    0x0001
#define ANER_PAGE_RX             0x0002
#define ANER_NEXT_PAGE_ABLE      0x0004
#define ANER_PRT_NEXT_PAGE_ABLE  0x0008
#define ANER_PARALLEL_DET_FAULT  0x0010

// PHY_ANNPTR Defs
#define ANNPTR_CODE_MASK         0x07FF
#define ANNPTR_TOGGLE            0x0800
#define ANNPTR_ACK2              0x1000
#define ANNPTR_MSG_PAGE          0x2000
#define ANNPTR_ACK               0x4000
#define ANNPTR_NEXT_PAGE_IND     0x8000


//****************************************************************************
// DP83848 Specific Register Bit Definitions
//****************************************************************************

// PHY_PHYSTS Defs
#define P848_STS_LINK            0x0001
#define P848_STS_SPEED           0x0002
#define P848_STS_DUPLEX          0x0004
#define P848_STS_LOOPBACK        0x0008
#define P848_STS_AUTO_NEG_DONE   0x0010
#define P848_STS_JABBER_DETECT   0x0020
#define P848_STS_REMOTE_FAULT    0x0040
#define P848_STS_MII_INTERRUPT   0x0080
#define P848_STS_PAGE_RXED       0x0100
#define P848_STS_DESCRAMBLER     0x0200
#define P848_STS_SIGNAL_DETECT   0x0400
#define P848_STS_FALSE_CARRIER   0x0800
#define P848_STS_POLARITY        0x1000
#define P848_STS_RX_ERROR_LATCH  0x2000
#define P848_STS_MDIX_MODE       0x4000

// PHY_MICR Defs
#define P848_MICR_INTEN          0x0001
#define P848_MICR_UNMSK_INT      0x0002
#define P848_MICR_TINT           0x0004

// PHY_MISR Defs
#define P848_MISR_UNMSK_RHF      0x0001
#define P848_MISR_UNMSK_FHF      0x0002
#define P848_MISR_UNMSK_ANC      0x0004
#define P848_MISR_UNMSK_RF       0x0008
#define P848_MISR_UNMSK_JAB      0x0010
#define P848_MISR_UNMSK_LINK     0x0020
#define P848_MISR_UNMSK_ED       0x0040
#define P848_MISR_MSK_RHF        0x0100
#define P848_MISR_MSK_FHF        0x0200
#define P848_MISR_MSK_ANC        0x0400
#define P848_MISR_MSK_RF         0x0800
#define P848_MISR_MSK_JAB        0x1000
#define P848_MISR_MSK_LINK       0x2000
#define P848_MISR_MSK_ED         0x4000

// PHY_PAGESEL Defs
#define P848_PAGESEL_PAGE_SEL    0x0001
#define P848_PAGESEL_PAGE_0      0x0000
#define P848_PAGESEL_PAGE_1      0x0001
#define P848_PAGESEL_PAGE_2      0x0002
#define P848_PAGESEL_PAGE_3      0x0003

// PHY_FCSCR Defs
#define P848_FCSCR_FCSCNT_MASK   0x00FF

// PHY_RECR Defs
#define P848_RECR_RXERRCNT_MASK  0x00FF

// PHY_PCSR Defs
#define P848_PCSR_DESCRAM_BYP    0x0001
#define P848_PCSR_SCRAM_BYP      0x0002
#define P848_PCSR_NRZI_BYP       0x0004
#define P848_PCSR_FEFI_EN        0x0008
#define P848_PCSR_FEFI_TST       0x0010
#define P848_PCSR_FORCE_100_OK   0x0020
#define P848_PCSR_FX_EN          0x0040
#define P848_PCSR_SD_OPTION      0x0100
#define P848_PCSR_SD_FORCE_PMA   0x0200
#define P848_PCSR_TQ_EN          0x0400
#define P848_PCSR_FREE_CLK       0x0800
#define P848_PCSR_BYP_4B5B       0x1000

// PHY_RBR Defs
#define P848_RBR_RX_RD_4         0x0000
#define P848_RBR_RX_RD_1         0x0001
#define P848_RBR_RX_RD_2         0x0002
#define P848_RBR_RX_RD_3         0x0003
#define P848_RBR_RX_UNF_STS      0x0004
#define P848_RBR_RX_OVF_STS      0x0008
#define P848_RBR_RMII_REV1_0     0x0010
#define P848_RBR_RMII_MODE       0x0020

// PHY_LEDCR Defs
#define P848_LED_ACTLED          0x0001
#define P848_LED_LNKLED          0x0002
#define P848_LED_SPDLED          0x0004
#define P848_LED_DRV_ACTLED      0x0008
#define P848_LED_DRV_LNKLED      0x0010
#define P848_LED_DRV_SPDLED      0x0020

// PHY_PHYCTRL Defs
#define P848_PHYCTRL_ADDR_MASK   0x001F
#define P848_PHYCTRL_LED_CFG0    0x0020
#define P848_PHYCTRL_LED_CFG1    0x0040
#define P848_PHYCTRL_BP_STRETCH  0x0080
#define P848_PHYCTRL_BIST_START  0x0100
#define P848_PHYCTRL_BIST_STS    0x0200
#define P848_PHYCTRL_PSR_15      0x0400
#define P848_PHYCTRL_BIST_FE     0x0800
#define P848_PHYCTRL_PAUSE_TX    0x1000
#define P848_PHYCTRL_PAUSE_RX    0x2000
#define P848_PHYCTRL_FORCE_MDIX  0x4000
#define P848_PHYCTRL_MDIX_EN     0x8000

// PHY_10BTSCR Defs
#define P848_10BTSCR_JABBER_DIS  0x0001
#define P848_10BTSCR_HRTBT_DIS   0x0002
#define P848_10BTSCR_SCALE_MSB   0x0004
#define P848_10BTSCR_ATDIS       0x0008
#define P848_10BTSCR_POLARITY    0x0010
#define P848_10BTSCR_FORCEPOL    0x0020
#define P848_10BTSCR_FRC_10      0x0040
#define P848_10BTSCR_LP_DIS      0x0080
#define P848_10BTSCR_LP_10_DIS   0x0100
#define P848_10BTSCR_SQLCH_MASK  0x0E00
#define P848_10BTSCR_ERRRG_MASK  0x3000
#define P848_10BTSCR_REJECT100T  0x4000
#define P848_10BTSCR_10BT_SER    0x8000

// PHY_CDCTRL1 Defs
#define P848_CDCTRL1_CDPATTSEL0  0x0001
#define P848_CDCTRL1_CDPATTSEL1  0x0002
#define P848_CDCTRL1_10MEG_PG    0x0004
#define P848_CDCTRL1_CDPATTEN10  0x0010
#define P848_CDCTRL1_BIST_CONT   0x0020
#define P848_CDCTRL1_BIST_EC_MSK 0xFF00

// PHY_EDCR Defs
#define P848_EDCR_DATA_CNT_MASK  0x000F
#define P848_EDCR_ERR_CNT_MASK   0x00F0
#define P848_EDCR_DATA_MET       0x0100
#define P848_EDCR_ERR_MET        0x0200
#define P848_EDCR_PWR_STATE      0x0400
#define P848_EDCR_BURST_DIS      0x0800
#define P848_EDCR_MANUAL_POWER   0x1000
#define P848_EDCR_AUTO_DOWN      0x2000
#define P848_EDCR_AUTO_UP        0x4000
#define P848_EDCR_ENABLE         0x8000

//****************************************************************************
// DP83849 Dual Specific Register Bit Definitions
//****************************************************************************

// PHY_RBR Defs Specific to this device
#define P849_RBR_ELAST_BUF_MASK  0x0003
#define P849_RBR_ELAST_14_BIT    0x0000
#define P849_RBR_ELAST_2_BIT     0x0001
#define P849_RBR_ELAST_6_BIT     0x0002
#define P849_RBR_ELAST_10_BIT    0x0003
#define P849_RBR_SINGLE_CLK_TX   0x0040
#define P849_RBR_SINGLE_CLK_RX   0x0080
#define P849_RBR_PMD_LOOP        0x0100
#define P849_RBR_TX_SOURCE_MASK  0x0600
#define P849_RBR_TX_NORMAL       0x0000
#define P849_RBR_TX_OPPOSITE     0x0200
#define P849_RBR_TX_OPPOSITE_RX  0x0400
#define P849_RBR_TX_DISABLED     0x0600
#define P849_RBR_RX_PORT_MASK    0x1800
#define P849_RBR_RX_NORMAL       0x0000
#define P849_RBR_RX_OPPOSITE     0x0800
#define P849_RBR_RX_BOTH_PORTS   0x1000
#define P849_RBR_RX_DISABLED     0x1800
#define P849_RBR_DIS_TX_LAT_OPT  0x2000
#define P849_RBR_SIM_WRITE_EN    0x8000

