EmbeddedSystemClass/freertosTMS570LC43x/TMS570LC43x/epl_1588/epl_regs.h
#define P849_RBR_NORMAL (P849_RBR_RX_NORMAL | P849_RBR_TX_NORMAL)
#define P849_RBR_SWAP   (P849_RBR_RX_OPPOSITE | P849_RBR_TX_OPPOSITE)
#define P849_RBR_EXT    (P849_RBR_RX_DISABLED | P849_RBR_TX_OPPOSITE_RX)

// PHY_PG0_PHYCR2 Def's
#define P849_FAST_ADAPT          0x0001
#define P849_SOFT_RESET          0x0200
#define PHYCR2_SYNC_ENET_EN      0x2000
#define PHYCR2_CLK_OUT_RX_EN     0x1000
#define PHYCR2_BC_WRITE_EN       0x0800
#define PHYCR2_PHY_CMP_MD        0x0400
#define PHYCR2_SOFT_RESET        0x0200
#define PHYCR2_CLK_OUT_DIS       0x0002

// PHY_PG1_PMDCNFG Def's
#define P849_TEST_MODE_MASK      0x0003
#define P849_TEST_MODE_NORMAL    0x0000
#define P849_TEST_MODE_ED_OB     0x0001
#define P849_TEST_MODE_MDIX_OB   0x0002
#define P849_TEST_MODE_FXC_OB    0x0003
#define P849_LEN100_AEQ          0x0100
#define P849_PMD_SOFT_RESET      0x0200
#define P849_AUTO_NEG_LOOPBACK   0x8000

// PHY_PG1_TMR1 Def's
#define P849_TEST_SEL_MASK       0x0007
#define P849_TEST_SEL_NORMAL     0x0000
#define P849_TEST_SEL_ADC        0x0001
#define P849_TEST_SEL_CD_OB      0x0002
#define P849_TEST_SEL_AN_RX_SM   0x0004
#define P849_TEST_SEL_AN_TX_SM   0x0005
#define P849_TEST_SEL_AN_ARM_SM  0x0006
#define P849_TEST_SEL_NLPLIT_SM  0x0007
#define P849_NRZ_OBSERVE         0x0008
#define P849_BYP_PLLS            0x0010
#define P849_BYP_ADC             0x0020
#define P849_DIS_IO_TURBO        0x0040
#define P849_ATP0_EN             0x0080
#define P849_ATP1_EN             0x0100
#define P849_SD_OBSERVE          0x0200
#define P849_PWRUP_OBSERVE       0x0400
#define P849_FCO_CTL_EN_OB       0x0800
#define P849_INVERT_ADC_CLK      0x1000
#define P849_MDIX_TX_INV         0x2000
#define P849_ADC_CLK_BYPASS      0x4000
#define P849_ADC_CLK_OE          0x8000

// PHY_PG1_TMR2 Def's
#define P849_PGM_VFILTER_LOW     0x0001
#define P849_PGM_VFILTER_HIGH    0x0002
#define P849_CGM_VFILTER_LOW     0x0004
#define P849_CGM_VFILTER_HIGH    0x0008
#define P849_MR_AAGC_10MB_MASK   0x00F0
#define P849_MR_AAGC_10MB_SHIFT  4
#define P849_MR_TM_RXSEL_MASK    0x0C00
#define P849_MR_TM_RXSEL_SHIFT   8
#define P849_MR_TM_TXSEL_MASK    0xF000
#define P849_MR_TM_TXSEL_SHIFT   12

// PHY_PG1_DSP_CTRL1 Def's
#define P849_AGC_ALPHA_MASK      0x0003
#define P849_FREEZE_AGC          0x0004
#define P849_LOAD_AGC            0x0008
#define P849_FREEZE_BLW          0x0010
#define P849_LOAD_BLW            0x0020
#define P849_FORCE_MSE_NOTOK     0x0040
#define P849_FORCE_MSE_OK        0x0080
#define P849_INIT_MSE            0x0100
#define P849_MSE_THSEL           0x0200
#define P849_AGC_7BITS           0x0400
#define P849_BLW_8BITS           0x0800
#define P849_IGNORE_MSEOK        0x2000
#define P849_DIS_PMD_INIT        0x4000
#define P849_PMD_INIT_TEST       0x8000

// PHY_PG1_DSP_CTRL2 Def's
#define P849_AAGC_THRESH_MASK    0x001F
#define P849_AAGC_FREEZE         0x0020
#define P849_LOAD_AAGC_ACC       0x0040
#define P849_LOAD_AAGC_TMR       0x0080
#define P849_FORCE_AEQ           0x0100
#define P849_FORCE_AEQ_VAL_MASK  0x0600
#define P849_FORCE_AEQ_VAL_SHIFT 9
#define P849_MAX_AEQ_MASK        0x1800
#define P849_MAX_AEQ_SHIFT       11
#define P849_DIS_AEQ_DECR        0x2000
#define P849_LOAD_AEQ_THRESH     0x4000

// PHY_PG1_TRL_CTRL Def's
#define P849_TRL_ALPHA_MASK      0x0003
#define P849_TRL_ALPHA_SHIFT     0
#define P849_TRL_BETA_MASK       0x000C
#define P849_TRL_BETA_SHIFT      2
#define P849_TRL_THRESH_MASK     0x00F0
#define P849_TRL_THRESH_SHIFT    4
#define P849_TRL_KILLREG         0x0100
#define P849_TRL_SEL_REG         0x0200
#define P849_RST_TRL_ON_ERR      0x0400
#define P849_TRL_FRZ_ACC         0x0800
#define P849_TRL_FRZ_LFO         0x1000
#define P849_LOAD_TRL_PHASE      0x2000
#define P849_LOAD_TRL_LFO        0x4000
#define P849_LOAD_TRL_BETA       0x8000

// PHY_PG1_DEQ_CTRL Def's
#define P849_KILL_COEFF_N1       0x0001
#define P849_KILL_EQ_TAP0        0x0002
#define P849_KILL_COEF1          0x0004
#define P849_KILL_COEF2          0x0008
#define P849_KILL_COEF3          0x0010
#define P849_FREEZE_COEF         0x0020
#define P849_NOSHIFT_N1          0x0040
#define P849_EQ_LOAD_COEF1       0x0080
#define P849_EQ_LOAD_COEF2       0x0100
#define P849_EQ_LOAD_COEF3       0x0200
#define P849_COEF1_9BITS         0x0400
#define P849_COEF2_8BITS         0x0800
#define P849_COEF3_7BITS         0x1000
#define P849_ALLOW_POS_C1        0x2000

// PHY_PG1_ANEG_TST Def's
#define P849_LOAD_ARB_TIMER      0x0100
#define P849_LOAD_TX_TIMER       0x0200
#define P849_LOAD_FLP_DATA_TIMER 0x0400
#define P849_LOAD_NLP_MIN_TIMER  0x0800
#define P849_LOAD_NLP_MAX_TIMER  0x1000
#define P849_LOAD_NLP_RX_TIMER   0x2000
#define P849_LOAD_ED_TIMER       0x4000

// PHY_PG1_EXTCFG Def's
#define P849_ADC_WATCHDOG_EN     0x0001
#define P849_ADC_WATCHDOG_TO_EN  0x0002
#define P849_ADC_WATCHDOG_ERR    0x0004
#define P849_MR_10BT_LR_MASK     0x0018
#define P849_MR_10BT_LR_SHIFT    3
#define P849_MR_NLP_RX_FIX       0x0020
#define P849_ADC_WD_THRESH_MASK  0x07C0
#define P849_ADC_WD_THRESH_SHIFT 6
#define P849_LP_THRESHOLD_MASK   0xF800
#define P849_LP_THRESHOLD_SHIFT  11

// PHY_PG1_TST_CTRL Def's
#define P849_SAMPLE_DATA         0x0001
#define P849_PLLBIST_RSTN        0x0002
#define P849_PLLBIST_EN          0x0004
#define P849_PLLBIST_MODE        0x0008
#define P849_PLLBIST_DONE        0x0010
#define P849_TEST_DATA_SEL_MASK  0xF800
#define P849_TEST_DATA_SEL_SHIFT 11

// PHY_PG1_SD_CNFG Def's
#define P849_SDOFFT_MASK         0x000F
#define P849_SDOFFT_SHIFT        0
#define P849_SDONT_MASK          0x00F0
#define P849_SDONT_SHIFT         4
#define P849_SIG_DET_TIME        0x0100
#define P849_FORCE_SIG_DET_PMD   0x0200
#define P849_10B_SCALE_LSB       0x0400
#define P849_MR_SHORT_CABLE      0x0800
#define P849_SIG_DET_TH_DELTA    0x1000
#define P849_100B_PMA_TEST_EN    0x2000
#define P849_AUTO_NEG_TEST_EN    0x4000
#define P849_SIG_DET_PTOP        0x8000

// PHY_PG2_LEN100_DET Def's
#define P849_CABLE_LEN_MASK      0x00FF
#define P849_CABLE_LEN_SHIFT     0
#define P849_AEQ_VAL_MASK        0x0300
#define P849_AEQ_VAL_SHIFT       8

