EmbeddedSystemClass/freertosTMS570LC43x/TMS570LC43x/epl_1588/epl_regs.h
// PHY_PG5_PTP_TRIG Def's
#define P640_TRIG_PULSE         0x8000
#define P640_TRIG_PER           0x4000
#define P640_TRIG_IF_LATE       0x2000
#define P640_TRIG_NOTIFY        0x1000
#define P640_TRIG_GPIO_SHIFT    8
#define P640_TRIG_GPIO_MASK     0x0F00
#define P640_TRIG_TOGGLE        0x0080
#define P640_TRIG_CSEL_SHIFT    1
#define P640_TRIG_CSEL_MASK     0x000E
#define P640_TRIG_WR            0x0001

// PHY_PG5_PTP_EVNT Def's
#define P640_EVNT_RISE          0x4000
#define P640_EVNT_FALL          0x2000
#define P640_EVNT_SINGLE        0x1000
#define P640_EVNT_GPIO_SHIFT    8
#define P640_EVNT_GPIO_MASK     0x0F00
#define P640_EVNT_SEL_SHIFT     1
#define P640_EVNT_SEL_MASK      0x000E
#define P640_EVNT_WR            0x0001

// PHY_PG5_PTP_TXCFG0 Def's
#define P640_SYNC_1STEP         0x8000
#define P640_DR_INSERT          0x2000
#define P640_NTP_TS_EN          0x1000
#define P640_IGNORE_2STEP       0x0800
#define P640_CRC_1STEP          0x0400
#define P640_CHK_1STEP          0x0200
#define P640_IP1588_EN          0x0100
#define P640_TX_L2_EN           0x0080
#define P640_TX_IPV6_EN         0x0040
#define P640_TX_IPV4_EN         0x0020
#define P640_TX_PTP_VER_SHIFT   1
#define P640_TX_PTP_VER_MASK    0x001E
#define P640_TX_TS_EN           0x0001

// PHY_PG5_PTP_TXCFG1 Def's
#define P640_BYTE0_MASK_SHIFT   8
#define P640_BYTE0_MASK_MASK    0xFF00
#define P640_BYTE0_DATA_SHIFT   0
#define P640_BYTE0_DATA_MASK    0x00FF

// PHY_PG5_PSF_CFG0 Def's
#define P640_MAC_SRC_ADD_SHIFT  11
#define P640_MAC_SRC_ADD_MASK   0x1800
#define P640_MIN_PRE_SHIFT      8
#define P640_MIN_PRE_MASK       0x0700
#define P640_PKT_ENDIAN         0x0080
#define P640_PKT_IPV4           0x0040
#define P640_PKT_PCFR_EN        0x0020
#define P640_PKT_ERR_EN         0x0010
#define P640_PKT_TXTS_EN        0x0008
#define P640_PKT_RXTS_EN        0x0004
#define P640_PKT_TRIG_EN        0x0002
#define P640_PKT_EVNT_EN        0x0001

// PHY_PG5_PTP_RXCFG0 Def's
#define P640_DOMAIN_EN          0x8000
#define P640_ALT_MAST_DIS       0x4000
#define P640_USER_IP_SEL        0x2000
#define P640_USER_IP_EN         0x1000
#define P640_RX_SLAVE           0x0800
#define P640_IP1588_EN2         0x0400
#define P640_IP1588_EN1         0x0200
#define P640_IP1588_EN0         0x0100
#define P640_RX_L2_EN           0x0080
#define P640_RX_IPV6_EN         0x0040
#define P640_RX_IPV4_EN         0x0020
#define P640_RX_PTP_VER_SHIFT   1
#define P640_RX_PTP_VER_MASK    0x001E
#define P640_RX_TS_EN           0x0001

// PHY_PG5_PTP_RXCFG1 Def's
#define P640_BYTE0_MASK_SHIFT   8
#define P640_BYTE0_MASK_MASK    0xFF00
#define P640_BYTE0_DATA_SHIFT   0
#define P640_BYTE0_DATA_MASK    0x00FF

// PHY_PG5_PTP_RXCFG3 Def's
#define P640_TS_MIN_IFG_SHIFT   12
#define P640_TS_MIN_IFG_MASK    0xF000
#define P640_ACC_UDP            0x0800
#define P640_ACC_CRC            0x0400
#define P640_TS_APPEND          0x0200
#define P640_TS_INSERT          0x0100
#define P640_PTP_DOMAIN_SHIFT   0
#define P640_PTP_DOMAIN_MASK    0x00FF

// PHY_PG5_PTP_RXCFG4 Def's
#define P640_IPV4_UDP_MOD       0x8000
#define P640_TS_SEC_EN          0x4000
#define P640_TS_SEC_LEN_SHIFT   12
#define P640_TS_SEC_LEN_MASK    0x3000
#define P640_RXTS_NS_OFF_SHIFT  6
#define P640_RXTS_NS_OFF_MASK   0x0FC0
#define P640_RXTS_SEC_OFF_SHIFT 0
#define P640_RXTS_SEC_OFF_MASK  0x003F

// PHY_PG5_PTP_TRDH Def's
#define P640_PTP_TR_DURH_SHIFT  0
#define P640_PTP_TR_DURH_MASK   0x03FF

// PHY_PG6_PTP_COC Def's
#define P640_PTP_CLKOUT_EN      0x8000
#define P640_PTP_CLKOUT_SEL     0x4000
#define P640_PTP_CLKOUT_SPSEL   0x2000
#define P640_PTP_CLKDIV_SHIFT   0
#define P640_PTP_CLKDIV_MASK    0x00FF

// PHY_PG6_PSF_CFG1 Def's
#define P640_PTP_RESERVED_SHIFT 12
#define P640_PTP_RESERVED_MASK  0xF000
#define P640_VERSION_PTP_SHIFT  8
#define P640_VERSION_PTP_MASK   0x0F00
#define P640_TRANSP_SPEC_SHIFT  4
#define P640_TRANSP_SPEC_MASK   0x00F0
#define P640_MESSAGE_TYPE_SHIFT 0
#define P640_MESSAGE_TYPE_MASK  0x000F

// PHY_PG6_PSF_CFG2 Def's
#define P640_IP_SA_BYTE1_SHIFT  8
#define P640_IP_SA_BYTE1_MASK   0xFF00
#define P640_IP_SA_BYTE0_SHIFT  0
#define P640_IP_SA_BYTE0_MASK   0x00FF

// PHY_PG6_PSF_CFG3 Def's
#define P640_IP_SA_BYTE3_SHIFT  8
#define P640_IP_SA_BYTE3_MASK   0xFF00
#define P640_IP_SA_BYTE2_SHIFT  0
#define P640_IP_SA_BYTE2_MASK   0x00FF

// PHY_PG6_PTP_SFDCFG Def's
#define P640_TX_SFD_GPIO_SHIFT  4
#define P640_TX_SFD_GPIO_MASK   0x00F0
#define P640_RX_SFD_GPIO_SHIFT  0
#define P640_RX_SFD_GPIO_MASK   0x000F

// PHY_PG6_PTP_INTCTL Def's
#define P640_PTP_INT_GPIO_SHIFT 0
#define P640_PTP_INT_GPIO_MASK  0x000F

// PHY_PG6_PTP_CLKSRC Def's
#define P640_CLK_SRC_SHIFT      14
#define P640_CLK_SRC_MASK       0xC000
#define P640_CLK_SRC_PER_SHIFT  0
#define P640_CLK_SRC_PER_MASK   0x007F

// PHY_PG6_PTP_OFF Def's
#define P640_PTP_OFFSET_SHIFT   0
#define P640_PTP_OFFSET_MASK    0x00FF

// PHY_PG6_PTP_GPIOMON Def's
#define P640_PTP_GPIO_IN_SHIFT  0
#define P640_PTP_GPIO_IN_MASK   0x0FFF

// PHY_PG6_PTP_RXHASH Def's
#define P640_RX_HASH_EN         0x1000
#define P640_PTP_RX_HASH_SHIFT  0
#define P640_PTP_RX_HASH_MASK   0x0FFF

#endif	// _EPL_REGS_INCLUDE
